~Cases/SpeciesTransport/simpleMixing/SS_Mixing_chtMultiRegionSimpleFoam/0.orig/fluid_0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0/fluid_0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
55970
(
(0.4640735 0.02058919 -0.003955263)
(0.4649892 0.02082136 -0.005671441)
(0.4661867 0.02079005 -0.007909333)
(0.4693088 0.02266153 -0.002852624)
(0.4700567 0.02289059 -0.004293657)
(0.4759467 0.02411316 -0.00462864)
(0.4817482 0.02491793 -0.004520903)
(0.4870772 0.02477149 -0.004391663)
...
)
;

boundaryField
{
    wall_nozzle
    {
        type            noSlip;
    }
    wall_air
    {
        type            noSlip;
    }
    symmetry
    {
        type            symmetry;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           nonuniform List<vector> 
263
(
(0.2303361 -0.006605796 -0.0007667266)
(0.1555676 -0.00305725 0.0002886388)
(0.5828243 0.009414432 -0.0135197)
(0.5722392 0.04331614 -0.06409725)
(0.4375187 0.04886424 -0.03528948)
(0.2241988 0.01604944 -0.006993795)
(0.6566859 -0.007702588 -0.1052827)
(0.5059668 0.1098279 -0.06228431)
...
)
;
    }
    inlet_bottom
    {
        type            noSlip;
    }
    inlet_top
    {
        type            surfaceNormalFixedValue;
        refValue        uniform -4.566;
    }
    inlet_air
    {
        type            surfaceNormalFixedValue;
        refValue        uniform -0.45;
    }
}


// ************************************************************************* //
