~Cases/SpeciesTransport/simpleMixing/SS_Mixing_chtMultiRegionSimpleFoam/0.orig/fluid_0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/fluid_0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
55970
(
100000.1
100000.1
100000.1
100000.1
100000.1
100000.1
100000.1
100000.1
...
)
;

boundaryField
{
    wall_nozzle
    {
        type            calculated;
        value           nonuniform List<scalar> 
2539
(
99999.81
99999.68
99999.5
99999.37
99999.59
99999.63
99999.66
99999.81
...
)
;
    }
    wall_air
    {
        type            calculated;
        value           nonuniform List<scalar> 
2553
(
100000.1
99999.84
99999.66
99999.86
99999.86
99999.78
99999.94
99999.96
...
)
;
    }
    symmetry
    {
        type            symmetry;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
263
(
99999.8
99999.79
99999.81
99999.84
99999.85
99999.86
99999.88
99999.88
...
)
;
    }
    inlet_bottom
    {
        type            calculated;
        value           uniform 100000.1;
    }
    inlet_top
    {
        type            calculated;
        value           nonuniform List<scalar> 
202
(
99996.4
99998.82
99993.1
99991.97
99990.89
99993.11
99998.02
99997.16
...
)
;
    }
    inlet_air
    {
        type            calculated;
        value           nonuniform List<scalar> 
265
(
100000.1
99999.95
99999.93
99999.96
99999.94
99999.95
99999.94
99999.99
...
)
;
    }
}


// ************************************************************************* //
