~Cases/SpeciesTransport/simpleMixing/SS_Mixing_chtMultiRegionSimpleFoam/0.orig/fluid_0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/fluid_0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
55970
(
100000.1
100000.1
100000.1
100000.1
100000.1
100000.1
100000.1
100000.1
...
)
;

boundaryField
{
    wall_nozzle
    {
        type            fixedFluxPressure;
        gradient        nonuniform List<scalar> 
2539
(
-2.273475e-05
-1.821481e-05
-1.539507e-05
-1.177506e-05
-2.539476e-05
-2.539107e-05
-2.539038e-05
-2.508131e-05
...
)
;
        value           nonuniform List<scalar> 
2539
(
100000
99999.91
99999.73
99999.6
99999.82
99999.85
99999.88
100000
...
)
;
    }
    wall_air
    {
        type            fixedFluxPressure;
        gradient        nonuniform List<scalar> 
2553
(
6.167951e-07
-2.557182e-05
-2.556431e-05
-2.558666e-05
-2.559128e-05
-2.554781e-05
-1.833447e-07
-5.700876e-07
...
)
;
        value           nonuniform List<scalar> 
2553
(
100000.1
100000.1
99999.89
100000.1
100000.1
100000
100000
100000.1
...
)
;
    }
    symmetry
    {
        type            symmetry;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 100000;
    }
    inlet_bottom
    {
        type            fixedFluxPressure;
        gradient        nonuniform List<scalar> 
199
(
-3.455753e-06
-3.455753e-06
-3.455753e-06
-3.455753e-06
-3.455753e-06
-3.455753e-06
-3.455753e-06
-3.455753e-06
...
)
;
        value           uniform 100000.1;
    }
    inlet_top
    {
        type            fixedFluxPressure;
        gradient        nonuniform List<scalar> 
202
(
-5011.942
-4733.688
-6730.288
-4033.087
-7880.494
-6003.902
-5208.978
-3871.252
...
)
;
        value           nonuniform List<scalar> 
202
(
99996.54
99998.96
99993.24
99992.11
99991.04
99993.25
99998.17
99997.31
...
)
;
    }
    inlet_air
    {
        type            fixedFluxPressure;
        gradient        nonuniform List<scalar> 
265
(
-4.14922e-07
-8.861377e-06
-9.565216e-06
4.22931e-06
-8.276618e-06
-3.513802e-07
-1.372777e-05
-3.152942e-05
...
)
;
        value           nonuniform List<scalar> 
265
(
100000.2
100000.2
100000.1
100000.1
100000.1
100000.1
100000.2
100000.2
...
)
;
    }
}


// ************************************************************************* //
