~Cases/SpeciesTransport/simpleMixing/SS_Mixing_chtMultiRegionSimpleFoam/0.orig/fluid_0/N2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/fluid_0";
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.79;

boundaryField
{
    wall_nozzle
    {
        type            zeroGradient;
    }
    wall_air
    {
        type            zeroGradient;
    }
    symmetry
    {
        type            symmetry;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.79;
        value           uniform 0.79;
    }
    inlet_bottom
    {
        type            zeroGradient;
    }
    inlet_top
    {
        type            fixedValue;
        value           uniform 0;
    }
    inlet_air
    {
        type            fixedValue;
        value           uniform 0.79;
    }
}


// ************************************************************************* //
