~Cases/SpeciesTransport/simpleMixing/SS_Mixing_chtMultiRegionSimpleFoam/0.orig/fluid_0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/fluid_0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
55970
(
300
300
300
300
300
300
300
300
...
)
;

boundaryField
{
    wall_nozzle
    {
        type            zeroGradient;
    }
    wall_air
    {
        type            zeroGradient;
    }
    symmetry
    {
        type            symmetry;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           nonuniform List<scalar> 
263
(
300.0046
300.0045
300.0193
300.0388
300.0312
300.0285
300.0944
300.06
...
)
;
    }
    inlet_bottom
    {
        type            zeroGradient;
    }
    inlet_top
    {
        type            fixedValue;
        value           uniform 300;
    }
    inlet_air
    {
        type            fixedValue;
        value           uniform 300;
    }
}


// ************************************************************************* //
