~Cases/SpeciesTransport/simpleMixing/SS_Mixing_chtMultiRegionSimpleFoam/0.orig/fluid_0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/fluid_0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
55970
(
7.862591e-05
7.665516e-05
8.128634e-05
5.200463e-05
5.156497e-05
3.798323e-05
2.903232e-05
2.329299e-05
...
)
;

boundaryField
{
    wall_nozzle
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    wall_air
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    symmetry
    {
        type            symmetry;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
263
(
1.263805e-10
1.083867e-10
5.474862e-07
2.211438e-06
2.789603e-07
1.377929e-09
1.686232e-05
1.012937e-06
...
)
;
    }
    inlet_bottom
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    inlet_top
    {
        type            calculated;
        value           nonuniform List<scalar> 
202
(
1.705426e-06
1.623132e-06
1.238086e-06
2.345226e-06
1.105322e-06
1.633627e-06
1.46198e-06
1.716383e-06
...
)
;
    }
    inlet_air
    {
        type            calculated;
        value           nonuniform List<scalar> 
265
(
4.827586e-05
3.065546e-05
5.986228e-05
0.002214379
7.43943e-05
0.0002143219
1.41253e-05
8.692531e-06
...
)
;
    }
}


// ************************************************************************* //
