~Cases/SpeciesTransport/simpleMixing/SS_Mixing_chtMultiRegionSimpleFoam/0.orig/fluid_0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/fluid_0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
55970
(
0.004024364
0.00402287
0.00403402
0.003970875
0.003973224
0.003897484
0.003789256
0.00365969
...
)
;

boundaryField
{
    wall_nozzle
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
2539
(
1.259006e-05
1.305137e-05
1.602135e-06
0.0001584806
3.67077e-05
3.905744e-05
3.90795e-05
1.631967e-05
...
)
;
    }
    wall_air
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
2553
(
2.294584e-05
9.568693e-06
3.947637e-05
3.403714e-06
2.673072e-06
1.665331e-05
0.0001356558
0.0001327675
...
)
;
    }
    symmetry
    {
        type            symmetry;
    }
    outlet
    {
        type            zeroGradient;
    }
    inlet_bottom
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
199
(
7.816783e-14
2.044645e-13
2.816099e-14
1.039532e-13
2.108414e-15
1.450589e-14
7.316814e-14
2.804824e-11
...
)
;
    }
    inlet_top
    {
        type            fixedValue;
        value           uniform 0.389;
    }
    inlet_air
    {
        type            fixedValue;
        value           uniform 0.004;
    }
}


// ************************************************************************* //
