~Cases/SpeciesTransport/simpleMixing/SS_Mixing_chtMultiRegionSimpleFoam/0.orig/fluid_0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/fluid_0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
55970
(
6.817812e-05
6.646924e-05
7.048504e-05
4.509427e-05
4.471303e-05
3.293603e-05
2.517452e-05
2.019782e-05
...
)
;

boundaryField
{
    wall_nozzle
    {
        type            nutkWallFunction;
        blending        stepwise;
        value           uniform 0;
    }
    wall_air
    {
        type            nutkWallFunction;
        blending        stepwise;
        value           uniform 0;
    }
    symmetry
    {
        type            symmetry;
    }
    outlet
    {
        type            zeroGradient;
    }
    inlet_bottom
    {
        type            nutkWallFunction;
        blending        stepwise;
        value           uniform 0;
    }
    inlet_top
    {
        type            calculated;
        value           nonuniform List<scalar> 
202
(
2.65166e-06
2.523647e-06
1.925087e-06
3.646607e-06
1.718692e-06
2.540108e-06
2.273105e-06
2.668677e-06
...
)
;
    }
    inlet_air
    {
        type            calculated;
        value           nonuniform List<scalar> 
265
(
4.186096e-05
2.658201e-05
5.190788e-05
0.001920135
6.450891e-05
0.0001858432
1.224835e-05
7.537478e-06
...
)
;
    }
}


// ************************************************************************* //
