~Cases/SpeciesTransport/simpleMixing/SS_Mixing_chtMultiRegionSimpleFoam/0.orig/fluid_0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/fluid_0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
55970
(
59.0272
60.52228
57.23229
88.05718
88.86053
118.335
150.5195
181.1923
...
)
;

boundaryField
{
    wall_nozzle
    {
        type            omegaWallFunction;
        blending        binomial;
        n               2;
        value           nonuniform List<scalar> 
2539
(
3.387849e+07
3.122875e+07
2.862696e+07
2.804171e+07
2.444711e+07
2.449562e+07
2.410479e+07
2.565568e+07
...
)
;
    }
    wall_air
    {
        type            omegaWallFunction;
        blending        binomial;
        n               2;
        value           nonuniform List<scalar> 
2553
(
100936.8
9986959
9996835
5313596
3971778
1.732629e+07
97331.58
106824.7
...
)
;
    }
    symmetry
    {
        type            symmetry;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 5;
        value           nonuniform List<scalar> 
263
(
1247.52
2562.706
463.4443
304.7822
526.8077
1449.392
283.5966
640.5712
...
)
;
    }
    inlet_bottom
    {
        type            omegaWallFunction;
        blending        binomial;
        n               2;
        value           nonuniform List<scalar> 
199
(
2836059
2934976
2305846
2859772
3164554
4354868
2969827
1461443
...
)
;
    }
    inlet_top
    {
        type            fixedValue;
        value           uniform 175;
    }
    inlet_air
    {
        type            fixedValue;
        value           uniform 1.46;
    }
}


// ************************************************************************* //
