~Cases/SpeciesTransport/simpleMixing/SS_Mixing_chtMultiRegionSimpleFoam/0.orig/fluid_0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceScalarField;
    location    "0/fluid_0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -1 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<scalar> 
271450
(
-3.389871e-09
3.287534e-07
1.352033e-08
2.320634e-09
-1.643031e-08
-3.247742e-07
-4.784849e-09
3.295405e-07
...
)
;

boundaryField
{
    wall_nozzle
    {
        type            calculated;
        value           nonuniform List<scalar> 
2539
(
0
0
-6.018531e-36
0
0
0
0
0
...
)
;
    }
    wall_air
    {
        type            calculated;
        value           nonuniform List<scalar> 
2553
(
0
0
0
0
7.70372e-34
0
0
0
...
)
;
    }
    symmetry
    {
        type            symmetry;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
263
(
2.87583e-07
3.165516e-08
9.860994e-07
1.101136e-06
6.665676e-07
1.7048e-07
9.312106e-07
8.693179e-07
...
)
;
    }
    inlet_bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
199
(
0
0
0
0
0
0
0
0
...
)
;
    }
    inlet_top
    {
        type            calculated;
        value           nonuniform List<scalar> 
202
(
-1.224258e-08
-7.191548e-09
-1.426278e-08
-1.250225e-07
-1.458203e-08
-5.176928e-08
-7.428596e-09
-3.522344e-08
...
)
;
    }
    inlet_air
    {
        type            calculated;
        value           nonuniform List<scalar> 
265
(
-9.919577e-07
-4.950873e-07
-6.788857e-07
-5.549162e-07
-5.429739e-07
-6.752122e-07
-2.706798e-07
-3.525567e-07
...
)
;
    }
}


// ************************************************************************* //
