~Cases/SpeciesTransport/simpleMixing/SS_Mixing_chtMultiRegionSimpleFoam/0.orig/fluid_0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/fluid_0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
55970
(
1.153243
1.153243
1.153243
1.153243
1.153243
1.153242
1.153242
1.153242
...
)
;

boundaryField
{
    wall_nozzle
    {
        type            calculated;
        value           nonuniform List<scalar> 
2539
(
1.149472
1.14741
1.145821
1.145023
1.150237
1.150268
1.150298
1.150593
...
)
;
    }
    wall_air
    {
        type            calculated;
        value           nonuniform List<scalar> 
2553
(
1.153242
1.152647
1.152477
1.152982
1.153086
1.152106
1.153238
1.153241
...
)
;
    }
    symmetry
    {
        type            symmetry;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
263
(
1.153221
1.153222
1.153165
1.153091
1.15312
1.15313
1.152877
1.153009
...
)
;
    }
    inlet_bottom
    {
        type            calculated;
        value           uniform 1.153243;
    }
    inlet_top
    {
        type            calculated;
        value           nonuniform List<scalar> 
202
(
0.6431539
0.6431695
0.6431327
0.6431254
0.6431185
0.6431328
0.6431644
0.6431589
...
)
;
    }
    inlet_air
    {
        type            calculated;
        value           nonuniform List<scalar> 
265
(
1.153243
1.153241
1.153241
1.153241
1.153241
1.153241
1.153241
1.153241
...
)
;
    }
}


// ************************************************************************* //
