~Cases/SpeciesTransport/simpleMixing/SS_Mixing_chtMultiRegionSimpleFoam/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    ignition;
        type    cellSet;
        action  new;
        source  sphereToCell;
    	origin  (0.01 0 0);
    	radius   0.0075;
    }
);

// ************************************************************************* //
